{
  "name": "lifecycle-policy",
  "version": "1.0.0",
  "description": "生命周期策略 — 保留/备份/过期/清理策略引擎，适用于记忆和资产的统一生命周期管理",
  "content": "# Lifecycle Policy\n\n## Overview\n\nRetention, backup, expiration, and cleanup policy engine. Applies to both memories and assets for unified lifecycle management.\n\n## Retention Policy\n\n**Purpose**: Define how long to keep data before archival or deletion.\n\n- **maxAge**: Maximum age (e.g. 90 days); older items are subject to onExpiry\n- **maxSize**: Maximum total size (e.g. 10GB); when exceeded, evict oldest or lowest-value\n- **onExpiry**: Action when retention limit reached:\n  - `archive`: Move to cold storage (read-only, excluded from normal retrieval)\n  - `delete`: Permanently remove\n  - `notify`: Alert user; defer action until acknowledged\n- **Scope**: Per asset type, per Template, or global default\n\n## Backup Policy\n\n**Purpose**: Create recoverable snapshots of critical state.\n\n- **Config snapshots**: Before config changes; store last N versions\n- **Data export**: Periodic export of memories, activity logs, asset metadata\n- **Schedule**: Time-based (daily, weekly) or event-based (before major change)\n- **Storage**: Local backup dir or external (user-configured)\n\n## Capacity Governance\n\n**Purpose**: Monitor disk usage and prevent overflow.\n\n- **Monitor**: Track disk usage for workspace, logs, temp, backups\n- **Thresholds**: Warn at 80%, critical at 95%\n- **Over-limit actions**:\n  - Notify user with breakdown (what's using space)\n  - Auto-cleanup: temp files, old logs, expired archives\n  - Delegate to Scavenger: orphan cleanup, aggressive reclaim\n- **Escalation**: If auto-cleanup insufficient, block new writes and alert\n\n## Expired Asset Archival / Cleanup\n\n**Purpose**: Apply retention policy to assets and memories.\n\n- **Expired assets**: Mark as archived; move to archive storage or delete per policy\n- **Expired memories**: Apply confidence decay; archive or evict per memory-governance rules\n- **Audit**: Log all archival/deletion for compliance and debugging\n\n## Orphan Asset Detection\n\n**Purpose**: Identify assets no longer referenced by any active Agent or user.\n\n- **Orphan criteria**: No Agent references; no recent access; owner Agent destroyed\n- **Detection**: Periodic scan; cross-reference with Agent registry, Template refs\n- **Actions**:\n  - Report to user: \"Asset X is orphaned; archive or delete?\"\n  - Auto-archive: If policy allows, move to orphan archive\n  - Delegate to Scavenger: Reclaim disk, remove from registry\n- **Safety**: Never auto-delete without explicit policy; prefer archive + notify",
  "tags": ["lifecycle", "retention", "backup", "curator"],
  "license": "MIT"
}
