{
  "name": "memory-governance",
  "version": "1.0.0",
  "description": "记忆治理 — 管理分层记忆系统的 Promote/衰减/去重/凝练，确保记忆质量与一致性",
  "content": "# Memory Governance\n\n## Overview\n\nManage the layered memory system: Promote, decay, deduplication, and condensation. Ensure memory quality and consistency across Instance, Template, and Actant layers.\n\n## Instance Memory Promote\n\n**Purpose**: Elevate high-value Instance memories to Template or Actant layers for broader reuse.\n\n### Promote Workflow\n\n1. **Candidate review**: Identify memories with high confidence, repeated use, or cross-session relevance\n2. **Conflict resolution**: Before Promote, check for contradictions with existing Template/Actant memories\n3. **Promotion**: Move approved candidates to `ac://memory/template/{templateId}/` or `ac://memory/actant/learnings/`\n4. **Source attribution**: Preserve origin Instance ID for traceability\n\n### Conflict Handling\n\n- If Instance memory contradicts Template memory: flag for human review or apply recency/confidence rule\n- If multiple Instances have conflicting memories: arbitrate by confidence score, usage count, or manual merge\n\n## Memory Deduplication\n\n**Purpose**: Reduce redundancy and maintain a single source of truth.\n\n- **contentHash detection**: Compute hash of normalized content; detect duplicates across layers\n- **Merge strategy**: Keep the most comprehensive version; merge metadata (confidence, timestamps, sources)\n- **Refinement**: Produce a condensed version that preserves all unique information\n\n## Memory Decay (Expiration)\n\n**Purpose**: Archive or retire low-confidence or stale memories.\n\n- **Confidence decay rules**: Apply time-based or usage-based decay to confidence scores\n- **Archive threshold**: When confidence < threshold, move to archive (read-only, excluded from retrieval)\n- **Eviction**: When archive exceeds capacity, delete lowest-value entries\n- **Audit trail**: Log all decay/archive/eviction actions for debugging\n\n## Memory Conflict Arbitration\n\n**Purpose**: Resolve contradictions when multiple Instances have conflicting memories.\n\n- **Detection**: Compare memories on same topic/entity; flag semantic contradictions\n- **Arbitration strategies**:\n  - Recency: Prefer newer memory\n  - Confidence: Prefer higher confidence\n  - Source authority: Prefer Template > Instance\n  - Manual: Escalate to human when automated resolution unclear\n- **Merge**: When possible, merge into a nuanced single memory (\"Usually X, but in context Y, Z\")\n\n## Cross-Template Generic Learnings\n\n**Purpose**: Identify and elevate learnings that apply across multiple Templates.\n\n- **Recognition**: Detect patterns that recur across different Template contexts\n- **Promotion target**: `ac://memory/actant/learnings/`\n- **Use case**: System-wide best practices, shared domain knowledge, common pitfalls\n- **Governance**: Curator reviews before Promote; avoid Template-specific details in Actant learnings",
  "tags": ["memory", "governance", "knowledge-management", "curator"],
  "license": "MIT"
}
